kapitel1/grundbegreber.org
* Demografi

Demografi er studiet af menneskers befolkningsegenskaber og deres
forandringer over tid og sted. Det inkluderer undersøgelser af
befolkningens størrelse, aldersfordeling, kønsfordeling, etnicitet,
sprog, religion, uddannelse, erhverv og andre relevante faktorer.
Demografer anvender forskellige metoder, såsom dataindsamling og
statistisk analyse, til at undersøge og beskrive befolkningstrends og
-mønstre. Demografi spiller en vigtig rolle i samfundets planlægning
og politikudvikling, da det kan give vigtig information om en
befolknings sundhedstilstand, uddannelsesbehov, arbejdsstyrke og
økonomisk udvikling. Nogle af de områder, hvor demografi er relevant,
inkluderer folkesundhed, økonomi, planlægning af byer og samfund,
arbejdsmarked og socialpolitik. Metoderne som vi bruger til demografi
er tæt beslægtet med metoder fra epidemiologi og statistik.

* Befolkning

I demografi refererer udtrykket /befolkning/ til den gruppe af
mennesker, der bor inden for et geografisk område eller en juridisk
enhed ved et bestemt tidspunkt. Dermed kan man tale om Danmarks
befolkning den 26 juni 1992, og om Nordeuropas befolkning den første
april 2000. En befolkning kan opdeles og analyseres efter kriterier
som for eksempel bopæl, køn, alder, civilstand, etnisk gruppe,
uddannelse, erhverv, fag og stilling. Tilsammen er alle disse grupper
udtryk for befolkningsstrukturen. En /befolkningsgruppe/ er en del af
en befolkning som opfylder yderlige kriterier. For eksempel, danner
alle Kvinder, som modtager SU, er yngre end 25 år, og bor i Region
Sjælland den 1 januar 2023, en befolkninggruppe.

Befolkning i demografi kan beskrives og analyseres med statistikker
som befolkningsstørrelse, befolkningstæthed, aldersfordeling,
kønsfordeling, etnicitet og mange andre faktorer, der kan give indsigt
i befolkningens dynamik og sammensætning. Disse statistikker bruges
ofte til at forudsige og planlægge behovet for offentlige tjenester og
politikker, såsom sundhedsvæsnet, uddannelse og beskæftigelse.


** Befolkningens størrelse

Lad os tage udgangspunkt i den danske befolkning og starte med at se
på dens størrelse. Folketal $N(t)$ angiver befolkningens størrelse til
tid $t$, hvor $t$ er en dato i kalenderen. Ifølge statistikbanken [fn:1] var
der 5.806.081 personer i Danmarks befolkning den 1 januar 2019:

\begin{align*}
\text{Befolkning} &= \text{Hele Danmark} \\
t_1&= \texttt{2019-01-01} \\
N(t_1) &= 5.806.081
\end{align*}

På et senere tidspunkt vil befolkningens størrelse have ændret sig som
følge af fødsler, dødsfald og ind- og udvandring. Den 1 januar 2023
var der 5.932.654 personer i Danmarks befolkning. Dermed er den danske
befolkning vokset med 126.573 personer i de 1461 dage mellem den 1
januar 2019 og den 1 januar 2023. Her er R-koder som kan bruges til at
beregne antal dage mellem to datoer og ændring af folketal i perioden.

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={t,as}
#+BEGIN_SRC R  :results output example :exports both  :session *R* :cache yes  
# R-code
t_1= as.Date("2019-01-01")
t_2= as.Date("2023-01-01")
N_1 = 5806081
N_2 = 5932654
data.frame("dato"=c(t_1,t_2),
           "Folketal"=c(N_1,N_2),
           "Antal dage"=c(NA,t_2-t_1),
           "Vækst"=c(NA,N_2-N_1))
#+END_SRC

:         dato Folketal Antal.dage  Vækst
: 1 2019-01-01  5806081         NA     NA
: 2 2023-01-01  5932654       1461 126573

Folketallet ændrer sig jo hver dag, men det er svært at registrere og
tælle nøjagtigt for enkelte dage. Heldigvis betyder små unøjagtigheder
i tallene typisk ikke meget for demografiske
konklusioner. Statistikbanken angiver folketal i starten af
hvert kvartal siden 2008 (FOLK1A), den første januar per år siden 1971
(BEFOLK1), den første januar per år siden 1901 (HISB3). Desuden er der
summariske tal fra folketællinger hele vejen fra 1769 (FT). Disse tal
bliver vist i Figure ref:fig:1.

#+BEGIN_SRC R :results file graphics :file ./kapitel1/figure1.pdf :exports none :session *R* :cache yes
library(danstat)
library(ggplot2)
library(ggthemes)
options(readr.show_col_types = FALSE)
dt_meta <- get_table_metadata("FT")
dt=get_data("FT",variables=list(list(code="tid",values=dt_meta$variables$values[[2]][[2]])))
ggplot(dt,aes(TID,INDHOLD))+geom_line()+geom_point()+theme_wsj()+ scale_colour_wsj("colors6")
#+END_SRC

#+RESULTS[(2023-11-06 11:34:16) e930586f8196697970f2e417b783cab3dc1c97f7]:
[[file:./kapitel1/figure1.pdf]]

#+name: fig:1
#+ATTR_LATEX: :width 0.7\textwidth
#+CAPTION: Udvikling af den danske befolkning siden 1769. Summariske tal fra folketællinger, statistikbankens register FT.
[[file:./figure1.pdf]]



[fn:1] https://statistikbanken.dk/

** Middelfolketal

Vi indfører nu begrebet middelfolketal, som bruges til at estimere et
gennemsnitlige folketal i en given tidsperiode.  Middelfolketallet er
en vigtig demografisk indikator, der indgår f.eks., i fertilitetsrater
og dødelighedstavler. Middelfolketallet er defineret som det
gennemsnitlige folketal i en given tidsperiode.  Vi betegner
middelfolketallet med $\tilde N$.

For at beregne middelfolketallet helt korrekt, ville man for alle
personer være nødt til at tælle hvor mange dage de har levet i
perioden i befolkningen.  Så kunne man beregne middelfolketallet
eksakt som den samlede gennemlevede tid divideret med periodens
længde. Denne beregning giver et gennemsnitligt antal mennesker, der
bor i området over en given tidsperiode.

Praktisk kender man desværre ikke de præcise tal, altså hvor mange
dage alle personer fra en befolkning har levet i en given
tidsperiode. Derfor er flere metoder, der kan bruges til at beregne
middelfolketallet approksimativt baseret på enkelte folketal i en
given tidsperiode.

***  Metode 1

Her skal man kun kende et enkelt folketal, nemlig folketallet cirka i
midten af perioden. Hvis perioden starter i tidspunkt $t_1$ og slutter
i tidspunkt $t_2$, så er tidspunkt i midten given som $(t_1+t_2)/2$ og
folketal i midten er given ved $\tilde N[t_1,t_2]=N((t_1+t_2)/2)$.

Dette tal bruges som et estimat for middelfolketallet. Denne metode er
simpel og tilstrækkeligt for mange formål, især når folketallet ikke
ændrer sig særlig meget i den given tidsperiode. For eksempel bruger
Danmark Statistik folketal fra den 1. juli som årets middelfolketal i
de årlige rapporter om befolknings udvikling [fn:2].

[fn:2] https://www.dst.dk/da/Statistik/nyheder-analyser-publ/Publikationer/

***  Metode 2

For at bruge denne metode skal man kende folketal i starten og i
slutningen af perioden. Det estimerede middelfolketal er
gennemsnit af de to folketal: $\tilde N[t_1,t_2]=(N(t_1)+N(t_2))/2$.

