kapitel1/grundbegreber.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-07 Tue 16:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Grundbegreber</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://publicifsv.sund.ku.dk/~tag/styles/all-purpose.css" />

</head>
<body>
<div id="preamble" class="status">
<br>Thomas Alexander Gerds
</div>
<div id="content" class="content">
<h1 class="title">Grundbegreber</h1>
<div id="outline-container-orge050d4d" class="outline-2">
<h2 id="orge050d4d">Demografi</h2>
<div class="outline-text-2" id="text-orge050d4d">
<p>
Demografi er studiet af menneskers befolkningsegenskaber og deres
forandringer over tid og sted. Det inkluderer undersøgelser af
befolkningens størrelse, aldersfordeling, kønsfordeling, etnicitet,
sprog, religion, uddannelse, erhverv og andre relevante faktorer.
Demografer anvender forskellige metoder, såsom dataindsamling og
statistisk analyse, til at undersøge og beskrive befolkningstrends og
-mønstre. Demografi spiller en vigtig rolle i samfundets planlægning
og politikudvikling, da det kan give vigtig information om en
befolknings sundhedstilstand, uddannelsesbehov, arbejdsstyrke og
økonomisk udvikling. Nogle af de områder, hvor demografi er relevant,
inkluderer folkesundhed, økonomi, planlægning af byer og samfund,
arbejdsmarked og socialpolitik. Metoderne som vi bruger til demografi
er tæt beslægtet med metoder fra epidemiologi og statistik.
</p>
</div>
</div>
<div id="outline-container-org30eab4e" class="outline-2">
<h2 id="org30eab4e">Befolkning</h2>
<div class="outline-text-2" id="text-org30eab4e">
<p>
I demografi refererer udtrykket <i>befolkning</i> til den gruppe af
mennesker, der bor inden for et geografisk område eller en juridisk
enhed ved et bestemt tidspunkt. Dermed kan man tale om Danmarks
befolkning den 26 juni 1992, og om Nordeuropas befolkning den første
april 2000. En befolkning kan opdeles og analyseres efter kriterier
som for eksempel bopæl, køn, alder, civilstand, etnisk gruppe,
uddannelse, erhverv, fag og stilling. Tilsammen er alle disse grupper
udtryk for befolkningsstrukturen. En <i>befolkningsgruppe</i> er en del af
en befolkning som opfylder yderlige kriterier. For eksempel, danner
alle Kvinder, som modtager SU, er yngre end 25 år, og bor i Region
Sjælland den 1 januar 2023, en befolkninggruppe.
</p>

<p>
Befolkning i demografi kan beskrives og analyseres med statistikker
som befolkningsstørrelse, befolkningstæthed, aldersfordeling,
kønsfordeling, etnicitet og mange andre faktorer, der kan give indsigt
i befolkningens dynamik og sammensætning. Disse statistikker bruges
ofte til at forudsige og planlægge behovet for offentlige tjenester og
politikker, såsom sundhedsvæsnet, uddannelse og beskæftigelse.
</p>
</div>
</div>
<div id="outline-container-org52e0563" class="outline-2">
<h2 id="org52e0563">Befolkningens størrelse</h2>
<div class="outline-text-2" id="text-org52e0563">
<p>
Lad os tage udgangspunkt i den Danske befolkning og starte med at se
på dens størrelse. Folketal \(N(t)\) angiver befolkningens størrelse til
tid \(t\), hvor \(t\) er en dato i kalenderen. Ifølge statistikbanken <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> var
der 5.806.081 personer i Danmarks befolkning den 1 januar 2019:
</p>

\begin{align*}
\text{Befolkning} &= \text{Hele Danmark} \\
t_1&= \texttt{2019-01-01} \\
N(t_1) &= 5.806.081
\end{align*}

<p>
På et senere tidspunkt vil befolkningens størrelse have ændret sig som
følge af fødsler, dødsfald og ind- og udvandring. Den 1 januar 2023
var der 5.932.654 personer i Danmarks befolkning. Dermed er den Danske
befolkning vokset med 126.573 personer i de 1461 dage mellem den 1
januar 2019 og den 1 januar 2023. Her er R-koder som kan bruges til at
beregne antal dage mellem to datoer og ændring af folketal i perioden.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #b22222;"># </span><span style="color: #b22222;">R-code</span>
t_1= as.Date(<span style="color: #8b2252;">"2019-01-01"</span>)
t_2= as.Date(<span style="color: #8b2252;">"2023-01-01"</span>)
N_1 = 5806081
N_2 = 5932654
data.frame(<span style="color: #8b2252;">"dato"</span>=c(t_1,t_2),
           <span style="color: #8b2252;">"Folketal"</span>=c(N_1,N_2),
           <span style="color: #8b2252;">"Antal dage"</span>=c(<span style="color: #228b22;">NA</span>,t_2-t_1),
           <span style="color: #8b2252;">"Vaekst"</span>=c(<span style="color: #228b22;">NA</span>,N_2-N_1))
</pre>
</div>

<pre class="example">
        dato Folketal Antal.dage  Vaekst
1 2019-01-01  5806081         NA     NA
2 2023-01-01  5932654       1461 126573
</pre>


<p>
Folketallet ændrer sig jo hver dag, men det er svært at registrere og
tælle nøjagtigt for enkelte dage. Heldigvis betyder små unøjagtigheder
i tallene typisk ikke meget for demografiske
konklusioner. Statistikbanken angiver folketal i starten af
hvert kvartal siden 2008 (FOLK1A), den første januar per år siden 1971
(BEFOLK1), den første januar per år siden 1901 (HISB3). Desuden er der
summariske tal fra folketællinger hele vejen fra 1769 (FT). Disse tal
bliver vist i Figure <a href="fig:1">fig:1</a>.
</p>

<p>
<a href="./figure1.pdf">./figure1.pdf</a>
</p>
</div>
<div id="outline-container-org04a13f5" class="outline-3">
<h3 id="org04a13f5">Middelfolketal</h3>
<div class="outline-text-3" id="text-org04a13f5">
<p>
Vi indfører nu begrebet middelfolketal, som bruges til at estimere et
gennemsnitlige folketal i en given tidsperiode.  Middelfolketallet er
en vigtig demografisk indikator, der indgår f.eks., i fertilitetsrater
og dødelighedstavler. Middelfolketallet er defineret som det
gennemsnitlige folketal i en given tidsperiode.  Vi betegner
middelfolketallet med \(\tilde N\).
</p>

<p>
For at beregne middelfolketallet helt korrekt, ville man for alle
personer være nødt til at tælle hvor mange dage de har levet i
perioden i befolkningen.  Så kunne man beregne middelfolketallet
eksakt som den samlede gennemlevede tid divideret med periodens
længde. Denne beregning giver et gennemsnitligt antal mennesker, der
bor i området over en given tidsperiode.
</p>

<p>
Praktisk kender man desværre ikke de præcise tal, altså hvor mange
dage alle personer fra en befolkning har levet i en given
tidsperiode. Derfor er flere metoder, der kan bruges til at beregne
middelfolketallet approksimativt baseret på enkelte folketal i en
given tidsperiode.
</p>
</div>
<div id="outline-container-orgd0ec39d" class="outline-4">
<h4 id="orgd0ec39d">Metode 1</h4>
<div class="outline-text-4" id="text-orgd0ec39d">
<p>
Her skal man kun kende et enkelt folketal, nemlig folketallet cirka i
midten af perioden. Hvis perioden starter i tidspunkt \(t_1\) og slutter
i tidspunkt \(t_2\), så er tidspunkt i midten given som \((t_1+t_2)/2\) og
folketal i midten er given ved \(\tilde N[t_1,t_2]=N((t_1+t_2)/2)\).
</p>

<p>
Dette tal bruges som et estimat for middelfolketallet. Denne metode er
simpel og tilstrækkeligt for mange formål, især når folketallet ikke
ændrer sig særlig meget i den given tidsperiode. For eksempel bruger
Danmark Statistik folketal fra den 1. juli som årets middelfolketal i
de årlige rapporter om befolknings udvikling <sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>
</div>
</div>
<div id="outline-container-orgf09694f" class="outline-4">
<h4 id="orgf09694f">Metode 2</h4>
<div class="outline-text-4" id="text-orgf09694f">
<p>
For at bruge denne metode skal man kende folketal i starten og i
slutningen af perioden. Det estimerede middelfolketal er
gennemsnit af de to folketal: \(\tilde N[t_1,t_2]=(N(t_1)+N(t_2))/2\).
</p>
</div>
</div>
