kapitel1/grundbegreber.org
***  Metode 3 

Her skal man kende folketal i starten, i slutningen og ved mindst et
tidspunkt mere i perioden. Lad os antage at vi kender folketal til $J$
forskelige tidspunkter $t_1 < t_2 < \dots <t_J$. Det estimerede
middelfolketal for perioden $[t_1,t_J]$ kan beregnes med følgende
formel:

\begin{align*}
\tilde N[t_1,t_J] &= \frac 1 {(t_J-t_1)}\sum_{j=2}^J (t_j-t_{j-1}) \frac{(N(t_{j-1})+N(t_j)}{2}\\
             &= \frac{(t_2-t_1)}{(t_J-t_1)}  \frac{(N(t_{2})+N(t_1)}{2} +\cdots +\frac{(t_J-t_{J-1})}{(t_J-t_1)}  \frac{(N(t_{J})+N(t_{J-1})}{2}
\end{align*}

Alle tre metoder kan bruges ligeværdig hvis folketallet er
relativt stabil i perioden.  Ændrer folketallet sig meget i perioden,
er metode 2 en bedre tilnærmelse til det sande ukendte
middelfolketal end metode 1, og ligeligt er metode 3
er bedre end metode 2. Figure ref:fig:2 visualiserer
forskellen mellem de 3 metoder.

#+BEGIN_SRC R :results file graphics :file ./kapitel1/figure2.pdf :exports none :session *R* :cache yes
par(mfrow=c(2,2))
## Metode 1
x <- as.Date(c(paste0("2019-",c("01","04","07","10"),"-01"),"2020-01-01"))
y <- c(5806081, 5811413,5814461,5827463,5822763)
plot(x,y,type="b",main=" Metode 1",xlim=as.Date(c("2019-01-01","2019-12-31")),ylab="Folketal N(t)",xlab="Kalenderår 2019",ylim=c(5800000,5850000),lty=1,lwd=3,pch=8,axes=FALSE)
rect(xleft=x[1],xright=x[5],ybottom=5800000,ytop=y[3],col="orange",border=NA,density=70)
lines(x,y,type="b",lwd=3)
axis(1,at=x,lab=c(paste0("K",1:4),"2020-01-01"))
axis(2)
## Metode 2
x <- as.Date(c(paste0("2019-",c("01","04","07","10"),"-01"),"2020-01-01"))
y <- c(5806081, 5811413,5814461,5827463,5822763)
plot(x,y,type="b",main=" Metode 2",xlim=as.Date(c("2019-01-01","2019-12-31")),ylab="Folketal N(t)",xlab="Kalenderår 2019",ylim=c(5800000,5850000),lty=1,lwd=3,pch=8,axes=FALSE)
u <- polygon(x=c(x[1],x[length(x)],x[length(x)],x[1]),y=c(y[1],y[length(y)],0,0),col=2,density=70)
lines(x,y,type="b",lwd=3)
axis(1,at=x,lab=c(paste0("K",1:4),"2020-01-01"))
axis(2)
## Metode 3
x <- as.Date(c(paste0("2019-",c("01","04","07","10"),"-01"),"2020-01-01"))
y <- c(5806081, 5811413,5814461,5827463,5822763)
plot(x,y,type="b",main=" Metode 3",xlim=as.Date(c("2019-01-01","2019-12-31")),ylab="Folketal N(t)",xlab="Kalenderår 2019",ylim=c(5800000,5850000),lty=1,lwd=3,pch=8,axes=FALSE)
polygon(x=as.numeric(c(x, rev(x))),y=as.numeric(c(y,rep(0,length(y)))),col=3,density=70)
lines(x,y,type="b",lwd=3)
axis(1,at=x,lab=c(paste0("K",1:4),"2020-01-01"))
axis(2)
## Summary
plot(0,0,type="n",xlab="",ylab="",main="Middelfolketal 2019",axes=0L)
library(plotrix)
library(data.table)
tab <- t(data.table("Metode 1"=y[3],
                    "Metode 2"=(y[1]+y[5])/2,
                    "Metode 3"=round(sum((y[-length(y)]+y[-1])/2*diff(as.numeric(x)))/365)))
tab <- cbind(rownames(tab),tab)
colnames(tab) <- c("Metode","Værdi")
plotrix::addtable2plot(x=-.7,y=-.5,tab,cex=1.3,hlines=1,vlines=1,xpad=.5,ypad=1)
#+END_SRC

#+RESULTS[(2023-11-06 13:21:05) 77ea44b083d599c057c029220aed9c1dbe33c8e7]:
[[file:./kapitel1/figure2.pdf]]

#+name: fig:2
#+ATTR_LATEX: :width 0.9\textwidth
#+CAPTION: Figuren viser de 3 metoder for at beregne middelfolketal baseret på 5 folketal: 1 januar 2019, 1 april 2019, 1 juli 2019, 1 october 2019, 1 januar 2023.
[[file:./figure2.pdf]]


*** Eksempel

Vi beregner middelfolketal for den danske befolkning i en periode, som
starter den 1 januar 2016 og slutter den 1 januar 2023. Fra
statistikbankens =BEFOLK1= henter vi folketal i starten, midten og
slutningen af perioden:

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output   :exports both  :session *R* :cache yes
library(danstat)
library(tidyverse)
library(stringi)
dt=get_data("BEFOLK1",variables=list(list(code="tid",values=c(2009,2016,2023))))
dt
#+END_SRC

#+RESULTS[(2023-11-02 17:57:32) dbd8ef89df9cf9a03dde3688b241153a20e5a806]:
#+begin_example
# A tibble: 3 × 2
    TID INDHOLD
  <dbl>   <dbl>
1  2009 5511451
2  2016 5707251
3  2023 5932654
#+end_example

Det er nemmest at anvende metode 1. Med metode 1 er
det estimerede middelfolketal \(\tilde N[\texttt{1 januar 2016},\texttt{1
jan 2023}] = 5.707.251\) personer. For at beregne metode 2
bruger vi R som lommerregner:

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output  example  :exports both  :session *R* :cache yes
# Metode 2
(5511451 + 5707251)/2
#+END_SRC

#+RESULTS[(2023-11-06 10:01:11) 78791514d677aa50d446ee4966a524a61a369c65]:
: [1] 5609351

Med metode 2 estimerer vi middelfolketallet i perioden 2009--2023 dermed til
\(5.609.351\) personer. For metode 3 er beregningen i R den følgende:

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output example  :exports both  :session *R* :cache yes  
# Metode 3
(2016-2009)/(2023-2009)*(5511451+5707251)/2 + (2023-2016)/(2023-2009)*(5707251+5932654)/2
#+END_SRC

#+RESULTS[(2023-11-06 10:00:59) f21cbcd580ee62077267204df1a604fd2ff170a1]:
: [1] 5714652

Med metode 3 estimerer vi middelfolketallet i perioden 2009--2023 til
\(5.714.652\) personer baseret på de 3 folketal fra perioden.  Vi ser
i det her eksempel at der er mere end 100.000 personer forskel mellem
metode 3 og metode 2. Om denne forskel er vigtigt eller ej, ville
afhænge formålet med den konkrete demografiske undersøgelse. Er den
vigtigt, ville man prøve at estimere middelfolketallet så godt som
muligt. For at gør det ville man hente så mange folketal som muligt
fra perioden, og så beregne middelfolketallet med metode 3 på alle
disse tal. Følgende R-koder henter alle folketal mellem 1 januar 2009
og 1 januar 2023 fra statistikbankens register FOLK1a og andvender
metode 3.

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output example  :exports both  :session *R* :cache yes  
library(tidyverse)
library(stringi)
# Metode 3 baseret på 57 folketal mellem 2009 og 2023
# konstruere vektor 2009K1, 2009K2, ..., 2022K4
kvartal_years <- paste0(rep(2009:2022,rep(4,14)),"K",1:4)
# tilføj 2023K1
kvartal_years <- c(kvartal_years,"2023K1")
# hent data fra FOLK1a 
dt <- get_data("FOLK1a",variables=list(list(code="tid",
                                            values=kvartal_years)))
# transform årstal + kvartal til dato
patt <- pattern=c("Q1","Q2","Q3","Q4")
repl <- c("-01-01","-01-04","-01-07","-01-10")
dt <- mutate(dt,
             TID=stri_replace_all_regex(TID,
                                        pattern=pat,
                                        replace=repl,
                                        vectorize_all=FALSE))
# transform fra character til dato
dt <- mutate(dt, TID=as.Date(TID)) 
# anvend middelfolketal metode 3
summarise(dt,{
  len <- length(TID)
  len_periode_total <- as.numeric(TID[length(TID)]-TID[1])
  len_periode <- as.numeric(TID[-1]-TID[-len])
  ft_gennemsnit <-(INDHOLD[-len]+INDHOLD[-1])/2 
  sum(len_periode*ft_gennemsnit)/len_periode_total
})
#+END_SRC

#+RESULTS[(2023-11-06 11:51:27) 3634bb3bd997b9588f2b0571e5cc102ae568a38d]:
: 5717974

Baseret på 57 folketal i perioden mellem den 1 januar 2009 og den 1
januar 2023 estimerer vi middelfolketal for perioden til 5.717.974
personer.

