kapitel1/grundbegreber.html
<div id="outline-container-org64755a6" class="outline-4">
<h4 id="org64755a6">Metode 3</h4>
<div class="outline-text-4" id="text-org64755a6">
<p>
Her skal man kende folketal i starten, i slutningen og ved mindst et
tidspunkt mere i perioden. Lad os antage at vi kender folketal til \(J\)
forskelige tidspunkter \(t_1 < t_2 < \dots <t_J\). Det estimerede
middelfolketal for perioden \([t_1,t_J]\) kan beregnes med følgende
formel:
</p>

\begin{align*}
\tilde N[t_1,t_J] &= \frac 1 {(t_J-t_1)}\sum_{j=2}^J (t_j-t_{j-1}) \frac{(N(t_{j-1})+N(t_j)}{2}\\
             &= \frac{(t_2-t_1)}{(t_J-t_1)}  \frac{(N(t_{2})+N(t_1)}{2} +\cdots +\frac{(t_J-t_{J-1})}{(t_J-t_1)}  \frac{(N(t_{J})+N(t_{J-1})}{2}
\end{align*}

<p>
Alle tre metoder kan bruges ligeværdig hvis folketallet er
relativt stabil i perioden.  Ændrer folketallet sig meget i perioden,
er metode 2 en bedre tilnærmelse til det sande ukendte
middelfolketal end metode 1, og ligeligt er metode 3
er bedre end metode 2. Figure <a href="fig:2">fig:2</a> visualiserer
forskellen mellem de 3 metoder.
</p>

<p>
<a href="./figure2.pdf">./figure2.pdf</a>
</p>
</div>
</div>
<div id="outline-container-org7402969" class="outline-4">
<h4 id="org7402969">Eksempel</h4>
<div class="outline-text-4" id="text-org7402969">
<p>
Vi beregner middelfolketal for den Danske befolkning i en periode, som
starter den 1 januar 2016 og slutter den 1 januar 2023. Fra
statistikbankens <code>BEFOLK1</code> henter vi folketal i starten, midten og
slutningen af perioden:
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #008b8b;">library</span>(danstat)
<span style="color: #008b8b;">library</span>(tidyverse)
<span style="color: #008b8b;">library</span>(stringi)
dt=get_data(<span style="color: #8b2252;">"BEFOLK1"</span>,variables=list(list(code=<span style="color: #8b2252;">"tid"</span>,values=c(2009,2016,2023))))
dt
</pre>
</div>

<pre class="example" id="orgfb42b29">
# A tibble: 3 × 2
    TID INDHOLD
  &lt;dbl&gt;   &lt;dbl&gt;
1  2009 5511451
2  2016 5707251
3  2023 5932654
</pre>

<p>
Det er nemmest at anvende metode 1. Med metode 1 er
det estimerede middelfolketal \(\tilde N[\texttt{1 januar 2016},\texttt{1
jan 2023}] = 5.707.251\) personer. For at beregne metode 2
bruger vi R som lommerregner:
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #b22222;"># </span><span style="color: #b22222;">Metode 2</span>
(5511451 + 5707251)/2
</pre>
</div>

<pre class="example">
[1] 5609351
</pre>


<p>
Med metode 2 estimerer vi middelfolketallet i perioden 2009&#x2013;2023 dermed til
\(5.609.351\) personer. For metode 3 er beregningen i R den følgende:
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #b22222;"># </span><span style="color: #b22222;">Metode 3</span>
(2016-2009)/(2023-2009)*(5511451+5707251)/2 + (2023-2016)/(2023-2009)*(5707251+5932654)/2
</pre>
</div>

<pre class="example">
[1] 5714652
</pre>


<p>
Med metode 3 estimerer vi middelfolketallet i perioden 2009&#x2013;2023 til
\(5.714.652\) personer baseret på de 3 folketal fra perioden.  Vi ser
i det her eksempel at der er mere end 100.000 personer forskel mellem
metode 3 og metode 2. Om denne forskel er vigtigt eller ej, ville
afhænge formålet med den konkrete demografiske undersøgelse. Er den
vigtigt, ville man prøve at estimere middelfolketallet så godt som
muligt. For at gør det ville man hente så mange folketal som muligt
fra perioden, og så beregne middelfolketallet med metode 3 på alle
disse tal. Følgende R-koder henter alle folketal mellem 1 januar 2009
og 1 januar 2023 fra statistikbankens register FOLK1a og andvender
metode 3.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #008b8b;">library</span>(tidyverse)
<span style="color: #008b8b;">library</span>(stringi)
<span style="color: #b22222;"># </span><span style="color: #b22222;">Metode 3 baseret paa 57 folketal mellem 2009 og 2023</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">konstruere vektor 2009K1, 2009K2, ..., 2022K4</span>
kvartal_years <span style="color: #008b8b;">&lt;-</span> paste0(rep(2009:2022,rep(4,14)),<span style="color: #8b2252;">"K"</span>,1:4)
<span style="color: #b22222;"># </span><span style="color: #b22222;">tilfoej 2023K1</span>
kvartal_years <span style="color: #008b8b;">&lt;-</span> c(kvartal_years,<span style="color: #8b2252;">"2023K1"</span>)
<span style="color: #b22222;"># </span><span style="color: #b22222;">hent data fra FOLK1a </span>
dt <span style="color: #008b8b;">&lt;-</span> get_data(<span style="color: #8b2252;">"FOLK1a"</span>,variables=list(list(code=<span style="color: #8b2252;">"tid"</span>,
                                            values=kvartal_years)))
<span style="color: #b22222;"># </span><span style="color: #b22222;">transform aarstal + kvartal til dato</span>
patt <span style="color: #008b8b;">&lt;-</span> pattern=c(<span style="color: #8b2252;">"Q1"</span>,<span style="color: #8b2252;">"Q2"</span>,<span style="color: #8b2252;">"Q3"</span>,<span style="color: #8b2252;">"Q4"</span>)
repl <span style="color: #008b8b;">&lt;-</span> c(<span style="color: #8b2252;">"-01-01"</span>,<span style="color: #8b2252;">"-01-04"</span>,<span style="color: #8b2252;">"-01-07"</span>,<span style="color: #8b2252;">"-01-10"</span>)
dt <span style="color: #008b8b;">&lt;-</span> mutate(dt,
             TID=stri_replace_all_regex(TID,
                                        pattern=pat,
                                        replace=repl,
                                        vectorize_all=<span style="color: #228b22;">FALSE</span>))
<span style="color: #b22222;"># </span><span style="color: #b22222;">transform fra character til dato</span>
dt <span style="color: #008b8b;">&lt;-</span> mutate(dt, TID=as.Date(TID)) 
<span style="color: #b22222;"># </span><span style="color: #b22222;">anvend middelfolketal metode 3</span>
summarise(dt,{
  len <span style="color: #008b8b;">&lt;-</span> length(TID)
  len_periode_total <span style="color: #008b8b;">&lt;-</span> as.numeric(TID[length(TID)]-TID[1])
  len_periode <span style="color: #008b8b;">&lt;-</span> as.numeric(TID[-1]-TID[-len])
  ft_gennemsnit <span style="color: #008b8b;">&lt;-</span>(INDHOLD[-len]+INDHOLD[-1])/2 
  sum(len_periode*ft_gennemsnit)/len_periode_total
})
</pre>
</div>

<pre class="example">
5717974
</pre>


<p>
Baseret på 57 folketal i perioden mellem den 1 januar 2009 og den 1
januar 2023 estimerer vi middelfolketal for perioden til 5.717.974
personer.
</p>
</div>
</div>
</div>
