kapitel1/grundbegreber.org
* Den demografiske ligevægtsligning

Den demografiske ligevægtsligning er en formel, der bruges i
demografisk analyse til at beskrive forholdet mellem antallet af
fødsler, dødsfald og migration i periode i en befolkning. Jo flere
dødsfald sker og jo flere personer emigrerer jo mindre er folketal i
slutningen af perioden sammenlignet med starten af perioden. Ligeligt
er folketal i slutningen jo højere jo flere personer bliver født og
indvandrer til befolkningen. Den demografiske ligevægtsligning for en
periode \([t1,t2]\) er:
\begin{equation*}
N(t_2) = N(t_1) + (F[t_1,t_2] - D[t_1,t_2]) + (I[t_1,t_2] - U[t_1,t_2]).
\end{equation*}
hvor vi har brugt følgende notation:
- $N(t_1)$ er folketal på tidspunkt $t_1$
- $N(t_2)$ er folketal på tidspunkt $t_2$
- $F(t_1,t_2)$ er antallet af fødsler i perioden
- $D(t_1,t_2)$ er antallet af dødsfald i perioden
- $I(t_1,t_2)$ er antallet af indvandrere i perioden
- $U(t_1,t_2)$ er antallet af udvandrere i perioden

Formlen siger kort sagt, at den samlede befolkning på et tidspunkt
$t_2$ er lig den samlede befolkning på tidspunktet $t_1$ plus en
stigning i befolkningen på grund af fødsler og indvandring og en
reduktion i befolkningen på grund af dødsfald og udvandring. Vi kalder
forskel mellem fødsler og dødsfald \((F[t_1,t_2] - D[t_1,t_2])\) for
/naturlig vækst/ og forskel mellem ind- og udvandring \((I[t_1,t_2] -
U[t_1,t_2])\) for /nettovandring/. Det giver følgende version af den
demografiske ligevægtsligning:

\begin{equation*}
\underbrace{N(t_2)-N(t_1)}_{\text{Vækst}}=\quad\underbrace{(F[t_1,t_2]-D[t_1,t_2])}_{\text{Naturlig vækst}} + 
\quad \underbrace{(I[t_1,t_2]-U[t_1,t_2])}_{\text{Nettovandring}}
\end{equation*}

Figure ref:fig:3 viser vækst, fødsler, dødsfald, ind- og udvandring
mellem 1980 og 2023 i den danske befolkning. Det er tydeligt at
indvandring er er den dominerede faktor for ændringer af folketal i
denne periode hvorimod fødsler og dødsfald holder et rimlig konstant
niveau. Man kan også se at udvandring er stigende helt op til 2019 men
knækker i 2020 på grund af corona krisen.

#+BEGIN_SRC R :results file graphics :file ./kapitel1/figure3.pdf :exports none :session *R* :cache yes 
setwd("~/metropolis/Teaching/demogRafi/")
library(data.table)
library(ggthemes)
library(ggplot2)
X <- data.table(rbind(cbind(X="Vækst",get_data("BEFOLK1",list(list(code="tid",values=1980:2022)))),
                      cbind(X="Dødsfald",get_data("DOD",list(list(code="tid",values=1980:2022)))),
                      cbind(X="Fødsler",get_data("FOD",list(list(code="tid",values=1980:2022)))),
                      cbind(X="Indvandring",get_data("INDVAN",list(list(code="tid",values=1980:2022)))),
                      cbind(X="Udvandring",get_data("UDVAN",list(list(code="tid",values=1980:2022))))))
X[X=="Vækst",INDHOLD:=INDHOLD- c(INDHOLD[1],INDHOLD[-length(INDHOLD)])]
X[X%in%c("Udvandring","Dødsfald"),INDHOLD:=-INDHOLD]
X[,X:=factor(X,levels=c("Dødsfald","Fødsler","Vækst","Indvandring","Udvandring"),labels=c("Dødsfald","Fødsler","Vækst","Indvandring","Udvandring"))]
ggplot(X,aes(TID,INDHOLD,color=X,group=X))+geom_line()+geom_point()+theme_wsj()+ scale_colour_wsj("colors6") +theme(legend.title=element_blank())
#+END_SRC

#+RESULTS[(2023-11-07 16:42:12) 81d0b22d2b67c2707054181d6f5676bef69b9d78]:
[[file:./kapitel1/figure3.pdf]]

#+name: fig:3
#+ATTR_LATEX: :width 0.9\textwidth
#+CAPTION: Siden 1980 ændring i folketal (vækst), antal fødsler, dødsfald, ind- og udvandring.
[[file:./figure3.pdf]]

*** Eksempel

Vi henter tal fra den danske befolkning i året 2022 fra
statistikbankens register FOLK1a, DOD, FOD, INDVAN og UDVAN.

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={list,c,D,I}
#+BEGIN_SRC R  :results output example  :exports both  :session *R* :cache yes
N <- get_data("FOLK1a",
              list(list(code="tid",
                        values=c("2022K1","2023K1"))))[["INDHOLD"]]
D <- get_data("DOD",
              list(list(code="tid",
                        values=2022)))[["INDHOLD"]]
F <- get_data("FOD",
              list(list(code="tid",
                        values=2022)))[["INDHOLD"]]
I <- get_data("INDVAN",
              list(list(code="tid",
                        values=2022)))[["INDHOLD"]]
U <- get_data("UDVAN",
              list(list(code="tid",
                        values=2022)))[["INDHOLD"]]
})
# data for ligevægtsligningen
data.frame(X=c("Folketal jan 2022",
               "Folketal jan 2023",
               "Fødsler 2022",
               "Dødsfald_2022",
               "Indvandring 2022",
               "Udvandre 2022"),
           Antal=c(N[1],N[2],F,D,I,U))
#+END_SRC

#+RESULTS[(2023-11-06 13:58:23) fef9517e3a345af0707b735604a6d6d84f13b2e9]:
:                   X   Antal
: 1 Folketal jan 2022 5873420
: 2 Folketal jan 2023 5932654
: 3     Fødsler 2022   58430
: 4    Dødsfald_2022   59435
: 5  Indvandring 2022  121183
: 6     Udvandre 2022   62927

Baseret på disse tal beregner vi at den danske befolkningens vækst i
perioden til (5.932.654 - 5.873.420) = 59.234 personer. Den naturlige
vækst i perioden er negativt: (58.430 - 59.345) = -915 personer og
nettovandring i perioden positivt: (121.183 - 62.927) = 58.256
personer. Vi ser at ligevægtsligningen ikke går op, der mangler 1893
personer:

#+begin_export latex
\begin{equation*}
\underbrace{59.234}_{\text{Vækst}}=\quad\underbrace{-915}_{\text{Naturlig vækst}} + 
\quad \underbrace{58.256}_{\text{Nettovandring}} + \underbrace{1893}_{\text{fejl}}.
\end{equation*}
#+end_export

Det vil sige at de forskelige register
som statistikbanken bogfører er ikke intern konsistent. Det kan være
mange grunde til. En vigtig grund er at det er svært at registrere de
præcise datoer hvor ind- og udvandringer sker.

* Rater

I demografi bruger vi rater til at beskrive befolkningens relative
ændringer, for at sammenligne forskelige befolkninger og for at
sammenligne befolkningsgrupper indenfor en befolkning. For eksempel
beskriver dødsraten antal døde relativt til befolkningens
størrelse. Det er som udgangspunkt typisk ikke meningsfyld at
sammenligne absolut antal døde i forskellige stor befolkninger. For
eksempel døde 569 personer på Bornholm og 2 personer på Christiansø
i 2022. Her kan man næppe konkludere at dødeligheden var højere på
Bornholm end på Christiansø. Brugen af rater frem for absolut antal er
yderst relevant når formålet er at sammenligne befolkninger som har
forskellig størrelse. For eksempel var mortalitetsraten på Bornholm i
2022 lige med 569/39817 = 14,3 per 1000 personår og på Christiansø
2/91 = 22,0 per 1000 personår i samme tidsperiode.

Som enhed for dødsraten bruges ofte /antal døde per personår/. Her
dividerer man antal døde i en periode med antal personår som personer
fra befolkningen har livet i samme periode. Mere generalt har en rate
som kendetegn at den er defineret som kvotient af to størrelser i
forskelige måleenheder. Ved beskrivelse af en rates enheder bruges
ordet ``per'' til at adskille enhederne for de to målinger, der bruges
til at beregne raten. For eksempel er hastighed af en cykel en rate
som kan beskrives med enheden /kilometer per time/. Der findes også
dimensionsløse rater som er kvotient af to forskelige størrelser med
samme måleenhed. Disse kan udtrykkes som en procentdel. De fleste
demografiske rater bruger /risikotid/ i nævneren og antal begivenheder
i tælleren og har dermed en enhed /antal begivenheder per personår/.


