kapitel1/grundbegreber.html
<div id="outline-container-org14ffdb3" class="outline-3">
<h3 id="org14ffdb3">Den demografiske ligevægtsligning</h3>
<div class="outline-text-3" id="text-org14ffdb3">
<p>
Den demografiske ligevægtsligning er en formel, der bruges i
demografisk analyse til at beskrive forholdet mellem antallet af
fødsler, dødsfald og migration i periode i en befolkning. Jo flere
dødsfald sker og jo flere personer emigrerer jo mindre er folketal i
slutningen af perioden sammenlignet med starten af perioden. Ligeligt
er folketal i slutningen jo højere jo flere personer bliver født og
indvandrer til befolkningen. Den demografiske ligevægtsligning for en
periode \([t1,t2]\) er:
</p>
\begin{equation*}
N(t_2) = N(t_1) + (F[t_1,t_2] - D[t_1,t_2]) + (I[t_1,t_2] - U[t_1,t_2]).
\end{equation*}
<p>
hvor vi har brugt følgende notation:
</p>
<ul class="org-ul">
<li>\(N(t_1)\) er folketal på tidspunkt \(t_1\)</li>
<li>\(N(t_2)\) er folketal på tidspunkt \(t_2\)</li>
<li>\(F(t_1,t_2)\) er antallet af fødsler i perioden</li>
<li>\(D(t_1,t_2)\) er antallet af dødsfald i perioden</li>
<li>\(I(t_1,t_2)\) er antallet af indvandrere i perioden</li>
<li>\(U(t_1,t_2)\) er antallet af udvandrere i perioden</li>
</ul>

<p>
Formlen siger kort sagt, at den samlede befolkning på et tidspunkt
\(t_2\) er lig den samlede befolkning på tidspunktet \(t_1\) plus en
stigning i befolkningen på grund af fødsler og indvandring og en
reduktion i befolkningen på grund af dødsfald og udvandring. Vi kalder
forskel mellem fødsler og dødsfald \((F[t_1,t_2] - D[t_1,t_2])\) for
<i>naturlig vækst</i> og forskel mellem ind- og udvandring \((I[t_1,t_2] -
U[t_1,t_2])\) for <i>nettovandring</i>. Det giver følgende version af den
demografiske ligevægtsligning:
</p>

\begin{equation*}
\underbrace{N(t_2)-N(t_1)}_{\text{Vækst}}=\quad\underbrace{(F[t_1,t_2]-D[t_1,t_2])}_{\text{Naturlig vækst}} + 
\quad \underbrace{(I[t_1,t_2]-U[t_1,t_2])}_{\text{Nettovandring}}
\end{equation*}

<p>
Figure <a href="fig:3">fig:3</a> viser vækst, fødsler, dødsfald, ind- og udvandring
mellem 1980 og 2023 i den Danske befolkning. Det er tydeligt at
indvandring er er den dominerede faktor for ændringer af folketal i
denne periode hvorimod fødsler og dødsfald holder et rimlig konstant
niveau. Man kan også se at udvandring er stigende helt op til 2019 men
knækker i 2020 på grund af corona krisen.
</p>

<p>
<a href="./figure3.pdf">./figure3.pdf</a>
</p>
</div>
<div id="outline-container-org604d1f7" class="outline-4">
<h4 id="org604d1f7">Eksempel</h4>
<div class="outline-text-4" id="text-org604d1f7">
<p>
Vi henter tal fra den Danske befolkning i året 2022 fra
statistikbankens register FOLK1a, DOD, FOD, INDVAN og UDVAN.
</p>

<div class="org-src-container">
<pre class="src src-R">N <span style="color: #008b8b;">&lt;-</span> get_data(<span style="color: #8b2252;">"FOLK1a"</span>,
              list(list(code=<span style="color: #8b2252;">"tid"</span>,
                        values=c(<span style="color: #8b2252;">"2022K1"</span>,<span style="color: #8b2252;">"2023K1"</span>))))[[<span style="color: #8b2252;">"INDHOLD"</span>]]
D <span style="color: #008b8b;">&lt;-</span> get_data(<span style="color: #8b2252;">"DOD"</span>,
              list(list(code=<span style="color: #8b2252;">"tid"</span>,
                        values=2022)))[[<span style="color: #8b2252;">"INDHOLD"</span>]]
F <span style="color: #008b8b;">&lt;-</span> get_data(<span style="color: #8b2252;">"FOD"</span>,
              list(list(code=<span style="color: #8b2252;">"tid"</span>,
                        values=2022)))[[<span style="color: #8b2252;">"INDHOLD"</span>]]
I <span style="color: #008b8b;">&lt;-</span> get_data(<span style="color: #8b2252;">"INDVAN"</span>,
              list(list(code=<span style="color: #8b2252;">"tid"</span>,
                        values=2022)))[[<span style="color: #8b2252;">"INDHOLD"</span>]]
U <span style="color: #008b8b;">&lt;-</span> get_data(<span style="color: #8b2252;">"UDVAN"</span>,
              list(list(code=<span style="color: #8b2252;">"tid"</span>,
                        values=2022)))[[<span style="color: #8b2252;">"INDHOLD"</span>]]
})
<span style="color: #b22222;"># </span><span style="color: #b22222;">data for ligevaegtsligningen</span>
data.frame(X=c(<span style="color: #8b2252;">"Folketal jan 2022"</span>,
               <span style="color: #8b2252;">"Folketal jan 2023"</span>,
               <span style="color: #8b2252;">"Foedsler 2022"</span>,
               <span style="color: #8b2252;">"Doedsfald_2022"</span>,
               <span style="color: #8b2252;">"Indvandring 2022"</span>,
               <span style="color: #8b2252;">"Udvandre 2022"</span>),
           Antal=c(N[1],N[2],F,D,I,U))
</pre>
</div>

<pre class="example">
                  X   Antal
1 Folketal jan 2022 5873420
2 Folketal jan 2023 5932654
3     Foedsler 2022   58430
4    Doedsfald_2022   59435
5  Indvandring 2022  121183
6     Udvandre 2022   62927
</pre>


<p>
Baseret på disse tal beregner vi at den Danske befolkningens vækst i
perioden til (5.932.654 - 5.873.420) = ø59.234 personer. Den naturlige
vækst i perioden er negativt: (58.430 - 59.345) = -915 personer og
nettovandring i perioden positivt: (121.183 - 62.927) = 58.256
personer. Vi ser at ligevægtsligningen ikke går op, der mangler 1893
personer:
</p>

<p>
Det vil sige at de forskelige register
som statistikbanken bogfører er ikke intern konsistent. Det kan være
mange grunde til. En vigtig grund er at det er svært at registrere de
præcise datoer hvor ind- og udvandringer sker.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc11eef1" class="outline-2">
<h2 id="orgc11eef1">Rater</h2>
<div class="outline-text-2" id="text-orgc11eef1">
<p>
I demografi bruger vi rater til at beskrive befolkningens relative
ændringer, for at sammenligne forskelige befolkninger og for at
sammenligne befolkningsgrupper indenfor en befolkning. For eksempel
beskriver dødsraten antal døde relativt til befolkningens
størrelse. Det er som udgangspunkt typisk ikke meningsfyld at
sammenligne absolut antal døde i forskellige stor befolkninger. For
eksempel døde 569 personer på Bornholm og 2 personer på Christiansø
i 2022. Her kan man næppe konkludere at dødeligheden var højere på
Bornholm end på Christiansø. Brugen af rater frem for absolut antal er
yderst relevant når formålet er at sammenligne befolkninger som har
forskellig størrelse. For eksempel var mortalitetsraten på Bornholm i
2022 lige med 569/39817 = 14,3 per 1000 personår og på Christiansø
2/91 = 22,0 per 1000 personår i samme tidsperiode.
</p>

<p>
Som enhed for dødsraten bruges ofte <i>antal døde per personår</i>. Her
dividerer man antal døde i en periode med antal personår som personer
fra befolkningen har livet i samme periode. Mere generalt har en rate
som kendetegn at den er defineret som kvotient af to størrelser i
forskelige måleenheder. Ved beskrivelse af en rates enheder bruges
ordet ``per'' til at adskille enhederne for de to målinger, der bruges
til at beregne raten. For eksempel er hastighed af en cykel en rate
som kan beskrives med enheden <i>kilometer per time</i>. Der findes også
dimensionsløse rater som er kvotient af to forskelige størrelser med
samme måleenhed. Disse kan udtrykkes som en procentdel. De fleste
demografiske rater bruger <i>risikotid</i> i nævneren og antal begivenheder
i tælleren og har dermed en enhed <i>antal begivenheder per personår</i>.
</p>
</div>
