kapitel1/grundbegreber.org
** Risikotid

Vi betegner med \(R[t_1,t_2]\) det samlede gennemlevede tid i perioden
\([t_1,t_2]\) af alle personer i en befolkning og kalder den også for
/risikotid/. Udtrykket /risikotid/ giver egentlig kun mening når man
studerer en risikabel hændelse, som for eksempel død, blandt personer,
som er eksponeret for denne hændelse i perioden. Det er især i
epidemiologi hvor man for eksempel kan interessere sig for
sygdomsrater hvor nævneren er risikotid fra personer som var
eksponeret til sygdomsrisiko. Men, i demografi bruger vi udtrykket
/risikotid/ også i andre sammenhænge. Enheden for risikotid er antal
personår. For at beskrive risikotid i lille befolkninger kan den
regnes om til antal personuger eller antal persondage. For stor
befolkninger vil man typisk regne om til enheder som /10.000
personår/, /100.000 personår/ eller /1.000.000 personår/. Kender man
det eksakte antal dage som alle personer fra en befolkning har livet i
en given periode beregner man risikotiden eksakt som sum af alle
persondage. Det kræver dog at man kender eksakte datoer for alle
fødsler, dødsfald, ind- og udvandringer i perioden.  Det gør man
sjældent. Men, man kan estimere risikotid baseret på registerdata. For
at estimere risikotid i en befolkning baseret på registerdata
multiplicerer vi typisk periodens middelfolketal med periodens
længde. For eksempel var middelfolketallet i 2022 på Bornholm 39.817
personer (tal fra statistikbankens register FOLK1a, metode 2 for
middelfolketallet). Vi estimerer dermed risikotid af Bornholms
befolkning i året 2022 til 39.817 personår.

** Perioderater

Mange demografiske rater er defineret som antal begivenheder i en
periode (f.eks., dødsfald eller indvandringer) relativt til antal
gennemlevede personår i samme periode i en befolkning:

\begin{equation*}
\mbox{Rate}_X[t_1,t_2]=\frac{\text{Antal begivenheder X i perioden } [t_1,t_2]}{R[t_1,t_2]}
\end{equation*}

Denne formel kan anvendes rimlig generalt. Man skal dog være opmærksom
på at en korrekt fortolkning af  perioderater kræver
kendskab af begivenheden (hvad), befolkningen (hvem) og perioden
(hvornår). Desuden skal man huske at angive enheden når man
rapporterer perioderater.

** Terminologi

Rater som tæller hændelser og risikotid i hele populationen kalder vi
for summariske rater. I det her kapitel omtaler vi kun summariske
rater. Senere i dette kompendium, introducerer vi også
aldersspecifikke rater og især standardiserede rater. I det her
kapitel glemmer vi prædikatet ``summarisk'' systematisk fra raterne.

*** Eksempel

Vi illustrerer beregningen af perioderater og bruger inderdanske
flytningsrater i perioden fra 1 januar 2020 til 1 januar 2023 som
eksempel. Først henter vi antal flytninger fra statistikbankens
register FLY.

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={list,c,as,numeric}
#+BEGIN_SRC R  :results output :exports both  :session *R* :cache yes  
# Antal flytninger indenfor Danmark i årene 2020, 2021, 2022
FL <- get_data("FLY",
               list(list(code="tid",
                         values=2020:2022)))
# Antal flytninger i perioden [2020,2022]
X <- pull(summarize(FL,sum(INDHOLD)))
X
#+END_SRC

: [1] 2773056

Der er 2.773.056 flytninger indenfor Danmark registreret i perioden
fra 1 januar 2020 til 1 januar 2023. Bagefter henter vi folketal fra statistikbankens
register FOLK1a og beregner middelfolketal med metode 2. Vi beregner
også risikotid.

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={list,c,as,numeric,R}
#+BEGIN_SRC R  :results output raw drawer  :exports both  :session *R* :cache yes  
# Folketal for den danske befolkning i perioden
N <- get_data("FOLK1a",list(list(code="tid",values=c("2020K1","2023K1"))))
# Middelfolketal metode 2
NN <-  summarise(N,middelfolketal=mean(INDHOLD))
# Risikotid
Risikotid <-  summarise(NN,R= middelfolketal * as.numeric(as.Date("2023-01-01")-as.Date("2020-01-01"))/365.25)
R <- pull(Risikotid)
R
#+END_SRC

: [1] 17637149

Riskotiden af den danske befolkning i perioden fra 1 januar 2020 til 1
jan 2023 er estimeret til 17.637.149 personår.

Til sidst beregner vi flytningsraten i perioden.

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output raw drawer  :exports both  :session *R* :cache yes
# Flytningsrate per personår
X/R
# Flytningsrate per 1000 personår
1000*X/R
#+END_SRC

: [1] 157.2281

Den inderdanske flytningsrate var 157.2 flytninger per 1000 personår i
perioden fra 1 januar 2020 til 1 januar 2023. Vi bemærker at vi har
brugt folketal fra den 1 januar 2023 i stedet for folketal fra den 31
december 2022. 

** Demografiske vækstrater

Vi kan anvende formlen for perioderater til mortalitetsrater
(begivenhed X er et dødsfald), fødselsrater (begivenhed X er en
fødsel), indvandringsrater (begivenhed X er en indvandring) og
udvandringsrater (begivenhed X er en udvandring). På den måde kan vi
beskrive en dekomposition af demografiske vækstrater.

Vi subtraherer \(N(t_1)\) fra begge sidder af den demografiske
ligevægtsligning og dividerer begge sidder med \(R[t_t,t_2]\). Det
giver følgende dekomposition af befolkningens vækstrate i perioden
\([t_1,t_2]\):

\begin{multline*}
\underbrace{\frac{N(t_2)-N(t_1)}{R[t_1,t_2]}}_{\text{Vækstrate}}=
\underbrace{\frac{F[t_1,t_2]}{R[t_1,t_2]}}_{\text{Fødselsrate}}
-
\underbrace{\frac{D[t_1,t_2]}{R[t_1,t_2]}}_{\text{Mortalitetsrate}}
\\
+
\underbrace{\frac{I[t_1,t_2]}{R[t_1,t_2]}}_{\text{Immigrationsrate}}
-
\underbrace{\frac{U[t_1,t_2]}{R[t_1,t_2]}}_{\text{Emigrationsrate}}
\end{multline*}

Vi bemærker at mortalitetsrater og udvandringsrater er
begivenhed/eksponering rater. Her giver udtrykket /risikotid/ mening,
fordi $R[t_1,t_2]$ stammer fra de personer som faktisk var under
risiko for hændelsen.

