kapitel1/grundbegreber.html
<div id="outline-container-org2f5d922" class="outline-3">
<h3 id="org2f5d922">Risikotid</h3>
<div class="outline-text-3" id="text-org2f5d922">
<p>
Vi betegner med \(R[t_1,t_2]\) det samlede gennemlevede tid i perioden
\([t_1,t_2]\) af alle personer i en befolkning og kalder den også for
<i>risikotid</i>. Udtrykket <i>risikotid</i> giver egentlig kun mening når man
studerer en risikabel hændelse, som for eksempel død, blandt personer,
som er eksponeret for denne hændelse i perioden. Det er især i
epidemiologi hvor man for eksempel kan interessere sig for
sygdomsrater hvor nævneren er risikotid fra personer som var
eksponeret til sygdomsrisiko. Men, i demografi bruger vi udtrykket
<i>risikotid</i> også i andre sammenhænge. Enheden for risikotid er antal
personår. For at beskrive risikotid i lille befolkninger kan den
regnes om til antal personuger eller antal persondage. For stor
befolkninger vil man typisk regne om til enheder som <i>10.000
personår</i>, <i>100.000 personår</i> eller <i>1.000.000 personår</i>. Kender man
det eksakte antal dage som alle personer fra en befolkning har livet i
en given periode beregner man risikotiden eksakt som sum af alle
persondage. Det kræver dog at man kender eksakte datoer for alle
fødsler, dødsfald, ind- og udvandringer i perioden.  Det gør man
sjældent. Men, man kan estimere risikotid baseret på registerdata. For
at estimere risikotid i en befolkning baseret på registerdata
multiplicerer vi typisk periodens middelfolketal med periodens
længde. For eksempel var middelfolketallet i 2022 på Bornholm 39.817
personer (tal fra statistikbankens register FOLK1a, metode 2 for
middelfolketallet). Vi estimerer dermed risikotid af Bornholms
befolkning i året 2022 til 39.817 personår.
</p>
</div>
</div>
<div id="outline-container-orgdde5634" class="outline-3">
<h3 id="orgdde5634">Perioderater</h3>
<div class="outline-text-3" id="text-orgdde5634">
<p>
Mange demografiske rater er defineret som antal begivenheder i en
periode (f.eks., dødsfald eller indvandringer) relativt til antal
gennemlevede personår i samme periode i en befolkning:
</p>

\begin{equation*}
\mbox{Rate}_X[t_1,t_2]=\frac{\text{Antal begivenheder X i perioden } [t_1,t_2]}{R[t_1,t_2]}
\end{equation*}

<p>
Denne formel kan anvendes rimlig generalt. Man skal dog være opmærksom
på at en korrekt fortolkning af perioderater kræver kendskab af
begivenheden (hvad), befolkningen (hvem) og perioden (hvornår).
Desuden skal man huske at angive enheden når man rapporterer
perioderater.
</p>
</div>
<div id="outline-container-orgbec8b9a" class="outline-4">
<h4 id="orgbec8b9a">Eksempel</h4>
<div class="outline-text-4" id="text-orgbec8b9a">
<p>
Vi illustrerer beregningen af perioderater og bruger inderdanske
flytningsrater i perioden fra 1 januar 2020 til 1 januar 2023 som
eksempel. Først henter vi antal flytninger fra statistikbankens
register FLY.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #b22222;"># </span><span style="color: #b22222;">Antal flytninger indenfor Danmark i aarene 2020, 2021, 2022</span>
FL <span style="color: #008b8b;">&lt;-</span> get_data(<span style="color: #8b2252;">"FLY"</span>,
               list(list(code=<span style="color: #8b2252;">"tid"</span>,
                         values=2020:2022)))
<span style="color: #b22222;"># </span><span style="color: #b22222;">Antal flytninger i perioden [2020,2022]</span>
X <span style="color: #008b8b;">&lt;-</span> pull(summarize(FL,sum(INDHOLD)))
X
</pre>
</div>

<pre class="example">
[1] 2773056
</pre>


<p>
Der er 2.773.056 flytninger indenfor Danmark registreret i perioden
fra 1 januar 2020 til 1 januar 2023. Bagefter henter vi folketal fra statistikbankens
register FOLK1a og beregner middelfolketal med metode 2. Vi beregner
også risikotid.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #b22222;"># </span><span style="color: #b22222;">Folketal for den Danske befolkning i perioden</span>
N <span style="color: #008b8b;">&lt;-</span> get_data(<span style="color: #8b2252;">"FOLK1a"</span>,list(list(code=<span style="color: #8b2252;">"tid"</span>,values=c(<span style="color: #8b2252;">"2020K1"</span>,<span style="color: #8b2252;">"2023K1"</span>))))
<span style="color: #b22222;"># </span><span style="color: #b22222;">Middelfolketal metode 2</span>
NN <span style="color: #008b8b;">&lt;-</span>  summarise(N,middelfolketal=mean(INDHOLD))
<span style="color: #b22222;"># </span><span style="color: #b22222;">Risikotid</span>
Risikotid <span style="color: #008b8b;">&lt;-</span>  summarise(NN,R= middelfolketal * as.numeric(as.Date(<span style="color: #8b2252;">"2023-01-01"</span>)-as.Date(<span style="color: #8b2252;">"2020-01-01"</span>))/365.25)
R <span style="color: #008b8b;">&lt;-</span> pull(Risikotid)
R
</pre>
</div>

<pre class="example">
[1] 17637149
</pre>


<p>
Riskotiden af den Danske befolkning i perioden fra 1 januar 2020 til 1
jan 2023 er estimeret til 17.637.149 personår.
</p>

<p>
Til sidst beregner vi flytningsraten i perioden.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #b22222;"># </span><span style="color: #b22222;">Flytningsrate per personaar</span>
X/R
<span style="color: #b22222;"># </span><span style="color: #b22222;">Flytningsrate per 1000 personaar</span>
1000*X/R
</pre>
</div>

<pre class="example">
[1] 157.2281
</pre>


<p>
Den inderdanske flytningsrate var 157.2 flytninger per 1000 personår i
perioden fra 1 januar 2020 til 1 januar 2023. Vi bemærker at vi har
brugt folketal fra den 1 januar 2023 i stedet for folketal fra den 31
december 2022. 
</p>
</div>
</div>
</div>
<div id="outline-container-org09c94ad" class="outline-3">
<h3 id="org09c94ad">Demografiske vækstrater</h3>
<div class="outline-text-3" id="text-org09c94ad">
<p>
Vi kan anvende formlen for perioderater til mortalitetsrater
(begivenhed X er et dødsfald), fødselsrater (begivenhed X er en
fødsel), indvandringsrater (begivenhed X er en indvandring) og
udvandringsrater (begivenhed X er en udvandring). På den måde kan vi
beskrive en dekomposition af demografiske vækstrater.
</p>

<p>
Vi subtraherer \(N(t_1)\) fra begge sidder af den demografiske
ligevægtsligning og dividerer begge sidder med \(R[t_t,t_2]\). Det
giver følgende dekomposition af befolkningens vækstrate i perioden
\([t_1,t_2]\):
</p>

\begin{multline*}
\underbrace{\frac{N(t_2)-N(t_1)}{R[t_1,t_2]}}_{\text{Vækstrate}}=
\underbrace{\frac{F[t_1,t_2]}{R[t_1,t_2]}}_{\text{Fødselsrate}}
-
\underbrace{\frac{D[t_1,t_2]}{R[t_1,t_2]}}_{\text{Mortalitetsrate}}
\\
+
\underbrace{\frac{I[t_1,t_2]}{R[t_1,t_2]}}_{\text{Immigrationsrate}}
-
\underbrace{\frac{U[t_1,t_2]}{R[t_1,t_2]}}_{\text{Emigrationsrate}}
\end{multline*}

<p>
Vi bemærker at mortalitetsrater og udvandringsrater er
begivenhed/eksponering rater. Her giver udtrykket <i>risikotid</i> mening,
fordi \(R[t_1,t_2]\) stammer fra de personer som faktisk var under
risiko for hændelsen.
</p>
</div>
